{"Eukaryota": "The eukaryotes ( yoo-KARR-ee-ohts, -⁠əts) constitute the domain of Eukarya or Eukaryota, organisms whose cells have a membrane-bound nucleus. All animals, plants, fungi, and many unicellular organisms are eukaryotes. They constitute a major group of life forms alongside the two groups of prokaryotes: the Bacteria and the Archaea. Eukaryotes represent a small minority of the number of organisms, but given their generally much larger size, their collective global biomass is much larger than that of prokaryotes.\nThe eukaryotes seemingly emerged within the Asgard archaea, and are  closely related to the Heimdallarchaeia. This implies that there are only two domains of life, Bacteria and Archaea, with eukaryotes incorporated among the Archaea. Eukaryotes first emerged during the Paleoproterozoic, likely as flagellated cells. The leading evolutionary theory is they were created by symbiogenesis between an anaerobic Asgard archaean and an aerobic proteobacterium, which formed the mitochondria. A second episode of symbiogenesis with a cyanobacterium created the plants, with chloroplasts.\nEukaryotic cells contain membrane-bound organelles such as the nucleus, the endoplasmic reticulum, and the Golgi apparatus. Eukaryotes may be either unicellular or multicellular. In comparison, prokaryotes are typically unicellular. Unicellular eukaryotes are sometimes called protists. Eukaryotes can reproduce both asexually through mitosis and sexually through meiosis and gamete fusion (fertilization).", "Metazoa": "Animals are multicellular, eukaryotic organisms in the biological kingdom Animalia. With few exceptions, animals consume organic material, breathe oxygen, have myocytes and are able to move, can reproduce sexually, and grow from a hollow sphere of cells, the blastula, during embryonic development. Animals form a clade, meaning they arose from a single common ancestor.\nOver 1.5 million living animal species have been described—of which around 1.05 million are insects, over 85,000 are molluscs, and around 65,000 are vertebrates. It has been estimated there are as many as 7.77 million animal species on Earth. Animal body lengths range from 8.5 μm (0.00033 in) to 33.6 m (110 ft). They have complex ecologies and interactions with each other and their environments, forming intricate food webs. The scientific study of animals is known as zoology, and the study of animal behaviors is known as ethology.\nMost living animal species belong to the infrakingdom Bilateria, a highly proliferative clade whose members have a bilaterally symmetric body plan. Extant bilaterians include the basal group Xenacoelomorpha, but the vast majority belong to two large superphyla: the protostomes, which includes organisms such as the arthropods, molluscs, flatworms, annelids and nematodes; and the deuterostomes, which include the echinoderms, hemichordates and chordates, the latter of which contains the vertebrates. \nAnimals first appear in the fossil record in the late Cryogenian period, and diversified in the subsequent Ediacaran. Earlier evidence of animals is still controversial; the sponge-like organism Otavia has been dated all the way back to the Tonian period, but its identity as an animal is heavily contested. Nearly all modern animal phyla became clearly established in the fossil record as marine species during the Cambrian explosion, which began around 539 million years ago (Mya), and most classes during the Ordovician radiation 485.4 Mya. 6,331 groups of genes common to all living animals have been identified; these may have arisen from a single common ancestor that lived about 650 Mya during the Cryogenian period.\nHistorically, Aristotle divided animals into those with blood and those without. Carl Linnaeus created the first hierarchical biological classification for animals in 1758 with his Systema Naturae, which Jean-Baptiste Lamarck expanded into 14 phyla by 1809. In 1874, Ernst Haeckel divided the animal kingdom into the multicellular Metazoa (now synonymous with Animalia) and the Protozoa, single-celled organisms no longer considered animals. In modern times, the biological classification of animals relies on advanced techniques, such as molecular phylogenetics, which are effective at demonstrating the evolutionary relationships between taxa.\nHumans make use of many other animal species for food (including meat, eggs and dairies), for materials (such as leather, fur and wool), as pets and as working animals for transportation, and services. Dogs, the first domesticated animal, have been used in hunting, in security and in warfare, as have horses, pigeons and birds of prey, while other terrestrial and aquatic animals are hunted for sports, trophies or profits. Non-human animals are also an important cultural element of human evolution, having appeared in cave arts and totems since the earliest times, and are frequently featured in mythology, religion, arts, literature, heraldry, politics and sports.", "Ecdysozoa": "Ecdysozoa () is a group of protostome animals, including Arthropoda (insects, chelicerata (including arachnids), crustaceans, and myriapods), Nematoda, and several smaller phyla. The grouping of these animal phyla into a single clade was first proposed by Eernisse et al. (1992) based on a phylogenetic analysis of 141 morphological characters of ultrastructural and embryological phenotypes. This clade, that is, a group consisting of a common ancestor and all its descendants, was formally named by Aguinaldo et al. in 1997, based mainly on phylogenetic trees constructed using 18S ribosomal RNA genes.A large study in 2008 by Dunn et al. strongly supported the monophyly of Ecdysozoa.The group Ecdysozoa is supported by many morphological characters, including growth by ecdysis, with moulting of the cuticle – without mitosis in the epidermis – under control of the prohormone ecdysone, and internal fertilization.The group was initially contested by a significant minority of biologists. Some argued for groupings based on more traditional taxonomic techniques, while others contested the interpretation of the molecular data.", "Arthropoda": "Arthropods () are invertebrates in the phylum Arthropoda. They possess an exoskeleton with a cuticle made of chitin, often mineralised with calcium carbonate, a body with differentiated (metameric) segments, and paired jointed appendages. In order to keep growing, they must go through stages of moulting, a process by which they shed their exoskeleton to reveal a new one. They are an extremely diverse group, with up to 10 million species.\nHaemolymph is the analogue of blood for most arthropods.  An arthropod has an open circulatory system, with a body cavity called a haemocoel through which haemolymph circulates to the interior organs. Like their exteriors, the internal organs of arthropods are generally built of repeated segments. Their nervous system is \"ladder-like\", with paired ventral nerve cords running through all segments and forming paired ganglia in each segment. Their heads are formed by fusion of varying numbers of segments, and their brains are formed by fusion of the ganglia of these segments and encircle the esophagus. The respiratory and excretory systems of arthropods vary, depending as much on their environment as on the subphylum to which they belong.\nArthropods use combinations of compound eyes and pigment-pit ocelli for vision. In most species, the ocelli can only detect the direction from which light is coming, and the compound eyes are the main source of information, but the main eyes of spiders are ocelli that can form images and, in a few cases, can swivel to track prey. Arthropods also have a wide range of chemical and mechanical sensors, mostly based on modifications of the many bristles known as setae that project through their cuticles. Similarly, their reproduction and development are varied; all terrestrial species use internal fertilization, but this is sometimes by indirect transfer of the sperm via an appendage or the ground, rather than by direct injection. Aquatic species use either internal or external fertilization. Almost all arthropods lay eggs, with many species giving birth to live young after the eggs have hatched inside the mother; but a few are genuinely viviparous, such as aphids. Arthropod hatchlings vary from miniature adults to grubs and caterpillars that lack jointed limbs and eventually undergo a total metamorphosis to produce the adult form. The level of maternal care for hatchlings varies from nonexistent to the prolonged care provided by social insects.\nThe evolutionary ancestry of arthropods dates back to the Cambrian period. The group is generally regarded as monophyletic, and many analyses support the placement of arthropods with cycloneuralians (or their constituent clades) in a superphylum Ecdysozoa. Overall, however, the basal relationships of animals are not yet well resolved. Likewise, the relationships between various arthropod groups are still actively debated. Today, arthropods contribute to the human food supply both directly as food, and more importantly, indirectly as pollinators of crops. Some species are known to spread severe disease to humans, livestock, and crops.", "Crustacea": "Crustaceans are a group of arthropods that are a part of the subphylum Crustacea (), a large, diverse group of mainly aquatic arthropods including decapods (shrimps, prawns, crabs, lobsters and crayfish), seed shrimp, branchiopods, fish lice, krill, remipedes, isopods, barnacles, copepods, opossum shrimps, amphipods and mantis shrimp. The crustacean group can be treated as a subphylum under the clade Mandibulata. It is now well accepted that the hexapods (insects and entognathans) emerged deep in the Crustacean group, with the completed group referred to as Pancrustacea. The three classes Cephalocarida, Branchiopoda and Remipedia are more closely related to the hexapods than they are to any of the other crustaceans (oligostracans and multicrustaceans).The 67,000 described species range in size from Stygotantulus stocki at 0.1 mm (0.004 in), to the Japanese spider crab with a leg span of up to 3.8 m (12.5 ft) and a mass of 20 kg (44 lb).  Like other arthropods, crustaceans have an exoskeleton, which they moult to grow. They are distinguished from other groups of arthropods, such as insects, myriapods and chelicerates, by the possession of biramous (two-parted) limbs, and by their larval forms, such as the nauplius stage of branchiopods and copepods.\nMost crustaceans are free-living aquatic animals, but some are terrestrial (e.g. woodlice, sandhoppers), some are parasitic (e.g. Rhizocephala, fish lice, tongue worms) and some are sessile (e.g. barnacles). The group has an extensive fossil record, reaching back to the Cambrian. More than 7.9 million tons of crustaceans per year are harvested by fishery or farming for human consumption, consisting mostly of shrimp and prawns. Krill and copepods are not as widely fished, but may be the animals with the greatest biomass on the planet, and form a vital part of the food chain. The scientific study of crustaceans is known as carcinology (alternatively, malacostracology, crustaceology or crustalogy), and a scientist who works in carcinology is a carcinologist.", "Multicrustacea": "The clade Multicrustacea constitutes the largest superclass of crustaceans, containing approximately four-fifths of all described crustacean species, including crabs, lobsters, crayfish, shrimp, krill, prawns, woodlice,  barnacles, copepods, amphipods, mantis shrimp and others. The largest branch of multicrustacea is the class Malacostraca (see below).", "Cirripedia": "Barnacles are arthropods of the subclass Cirripedia in the subphylum Crustacea. They are related to crabs and lobsters, with similar nauplius larvae. Barnacles are exclusively marine invertebrates; many species live in shallow and tidal waters. Some 2,100 species have been described.\nBarnacle adults are sessile; most are suspension feeders with hard calcareous shells, but the Rhizocephala are specialized parasites of other crustaceans, with reduced bodies. Barnacles have existed since at least the mid-Carboniferous, some 325 million years ago. \nIn folklore, barnacle geese were once held to emerge fully formed from goose barnacles. Both goose barnacles and the Chilean giant barnacle are fished and eaten. Barnacles are economically significant as biofouling on ships, where they cause hydrodynamic drag, reducing efficiency.", "Thoracica": "Thoracica is an infraclass of crustaceans which contains the most familiar species of barnacles found on rocky coasts, such as Semibalanus balanoides and Chthamalus stellatus. They have six well-developed limbs, and may be either stalked or sessile. The carapace is heavily calcified. The group includes free-living and commensal species.", "Thoracicalcarea": "", "Balanomorpha": "The Balanomorpha are an order of barnacles, containing familiar acorn barnacles of the seashore. The order contains these families:", "Balanoidea": "", "Balanidae": "The Balanidae comprise a family of barnacles of the order Balanomorpha. As a result of research published in 2021 by Chan et al., the members of the family Archaeobalanidae were merged with this family.", "Megabalaninae": "", "Megabalanus": "Megabalanus is a genus of barnacles in the family Balanidae. Members of the genus grow to 7 cm (2.8 in) in length and inhabit the lower intertidal zone."}